In [216]:
import csv , sqlite3
import pandas as pd
from sqlite3 import Error

 
def create_connection(db_file):
    """ create a database connection to the SQLite database
        specified by the db_file
    :param db_file: database file
    :return: Connection object or None
    """
    conn = None
    try:
        conn = sqlite3.connect(db_file)
        print(sqlite3.version)
    except Error as e:
        print(e)
 
    return conn

 
def select_all_tasks(conn):
    """
    Query all rows in the tasks table
    :param conn: the Connection object
    :return:
    """
    cur = conn.cursor()
    
    query1 = """
        SELECT *
        FROM FACILITIES
        """
    cur.execute(query1)
 
    rows = cur.fetchall()
 
    for row in rows:
        print(row)


def main():
    database = "sqlite_db_pythonsqlite.db"
 
    # create a database connection
    conn = create_connection(database)
    with conn: 
        print("2. Query all tasks")
        select_all_tasks(conn)
 
 
if __name__ == '__main__':
    main()

2.6.0
2. Query all tasks
(0, 'Tennis Court 1', 5, 25, 10000, 200)
(1, 'Tennis Court 2', 5, 25, 8000, 200)
(2, 'Badminton Court', 0, 15.5, 4000, 50)
(3, 'Table Tennis', 0, 5, 320, 10)
(4, 'Massage Room 1', 9.9, 80, 4000, 3000)
(5, 'Massage Room 2', 9.9, 80, 4000, 3000)
(6, 'Squash Court', 3.5, 17.5, 5000, 80)
(7, 'Snooker Table', 0, 5, 450, 15)
(8, 'Pool Table', 0, 5, 400, 15)

In [175]:
Members= pd.read_csv ('C:/Users/sejad/OneDrive/Desktop/Springboard folders/SQL case study/Members.csv')
Bookings= pd.read_csv ('C:/Users/sejad/OneDrive/Desktop/Springboard folders/SQL case study/Bookings.csv')
Facilities= pd.read_csv ('C:/Users/sejad/OneDrive/Desktop/Springboard folders/SQL case study/Facilities.csv')

In [ ]:
# I was unable to download the data from " sql.springboard.com"; consequently questions 1 to 9 
 /* were performed using Python codes mixed with SQL.

In [190]:
import sqlite3
connection = sqlite3.connect("sqlite_db_pythonsqlite.db")
cursor = connection.cursor()
cursor.execute("SELECT * FROM Facilities").fetchall()

[(0, 'Tennis Court 1', 5, 25, 10000, 200),
 (1, 'Tennis Court 2', 5, 25, 8000, 200),
 (2, 'Badminton Court', 0, 15.5, 4000, 50),
 (3, 'Table Tennis', 0, 5, 320, 10),
 (4, 'Massage Room 1', 9.9, 80, 4000, 3000),
 (5, 'Massage Room 2', 9.9, 80, 4000, 3000),
 (6, 'Squash Court', 3.5, 17.5, 5000, 80),
 (7, 'Snooker Table', 0, 5, 450, 15),
 (8, 'Pool Table', 0, 5, 400, 15)]

In [ ]:
/*/* QUESTIONS 
/* Q1: Some of the facilities charge a fee to members, but some do not.
Write a SQL query to produce a list of the names of the facilities that do. */

In [196]:
cursor.execute("SELECT * FROM Facilities WHERE membercost = 0.0  limit 0, 30").fetchall()

[(2, 'Badminton Court', 0, 15.5, 4000, 50),
 (3, 'Table Tennis', 0, 5, 320, 10),
 (7, 'Snooker Table', 0, 5, 450, 15),
 (8, 'Pool Table', 0, 5, 400, 15)]

In [ ]:
/* Q2: How many facilities do not charge a fee to members? */

In [197]:
cursor.execute("SELECT Count (*)  FROM Facilities WHERE membercost = 0.0  limit 0, 30").fetchall()

[(4,)]

In [ ]:
/* Q3: Write an SQL query to show a list of facilities that charge a fee to members,
where the fee is less than 20% of the facility's monthly maintenance cost.
Return the facid, facility name, member cost, and monthly maintenance of the
facilities in question. */

In [202]:
cursor.execute("""SELECT facid, name, membercost, monthlymaintenance FROM Facilities WHERE membercost >0 AND membercost < 0.2 * ( monthlymaintenance )
LIMIT 0, 30""" ).fetchall()

[(0, 'Tennis Court 1', 5, 200),
 (1, 'Tennis Court 2', 5, 200),
 (4, 'Massage Room 1', 9.9, 3000),
 (5, 'Massage Room 2', 9.9, 3000),
 (6, 'Squash Court', 3.5, 80)]

In [ ]:
/* Q4: Write an SQL query to retrieve the details of facilities with ID 1 and 5.
Try writing the query without using the OR operator. */

In [204]:
cursor.execute("SELECT * FROM Facilities WHERE facid IN (1,5) limit 0, 30").fetchall()

[(1, 'Tennis Court 2', 5, 25, 8000, 200),
 (5, 'Massage Room 2', 9.9, 80, 4000, 3000)]

In [ ]:
/* Q5: Produce a list of facilities, with each labelled as
'cheap' or 'expensive', depending on if their monthly maintenance cost is
more than $100. Return the name and monthly maintenance of the facilities
in question. */

In [208]:
cursor.execute("""
        SELECT name AS facility_name, 
               CASE WHEN monthlymaintenance < 100 THEN 'cheap' ELSE 'expensive' END AS category 
        FROM Facilities 
        LIMIT 0, 30
    """).fetchall()

[('Tennis Court 1', 'expensive'),
 ('Tennis Court 2', 'expensive'),
 ('Badminton Court', 'cheap'),
 ('Table Tennis', 'cheap'),
 ('Massage Room 1', 'expensive'),
 ('Massage Room 2', 'expensive'),
 ('Squash Court', 'cheap'),
 ('Snooker Table', 'cheap'),
 ('Pool Table', 'cheap')]

In [ ]:
/* Q6: You'd like to get the first and last name of the last member(s)
who signed up. Try not to use the LIMIT clause for your solution. */

In [209]:
cursor.execute("SELECT firstname, surname FROM Members ORDER BY joindate DESC Limit 1").fetchall()

[('Darren', 'Smith')]

In [ ]:
/* Q7: Produce a list of all members who have used a tennis court.
Include in your output the name of the court, and the name of the member
formatted as a single column. Ensure no duplicate data, and order by
the member name. */

In [211]:
cursor.execute("""
        SELECT DISTINCT BF.name AS facility_name, M.firstname, M.surname
        FROM 
            (SELECT B.memid, F.name
             FROM Bookings AS B 
             JOIN Facilities AS F ON B.facid = F.facid 
             WHERE F.name LIKE 'Tennis Court%'
            ) AS BF 
        JOIN Members AS M ON BF.memid = M.memid
        ORDER BY M.firstname, M.surname
        LIMIT 5
    """).fetchall()

[('Tennis Court 1', 'Anne', 'Baker'),
 ('Tennis Court 2', 'Anne', 'Baker'),
 ('Tennis Court 2', 'Burton', 'Tracy'),
 ('Tennis Court 1', 'Burton', 'Tracy'),
 ('Tennis Court 1', 'Charles', 'Owen')]

In [ ]:
/* Q8: Produce a list of bookings on the day of 2012-09-14 which
will cost the member (or guest) more than $30. Remember that guests have
different costs to members (the listed costs are per half-hour 'slot'), and
the guest user's ID is always 0. Include in your output the name of the
facility, the name of the member formatted as a single column, and the cost.
Order by descending cost, and do not use any subqueries. */

In [221]:
 cursor.execute("""
       SELECT f.name AS Facility, 
              m.firstname || ' ' || m.surname AS Member,
              CASE WHEN b.memid != 0 THEN f.membercost * b.slots
                   ELSE f.guestcost * b.slots
              END AS Cost
       FROM Bookings AS b
       JOIN Members AS m ON b.memid = m.memid
       JOIN Facilities AS f ON b.facid = f.facid
       WHERE b.starttime > '2012-09-14' 
         AND b.starttime < '2012-09-15'
       GROUP BY b.bookid
       HAVING Cost > 30
       ORDER BY Cost DESC
       LIMIT 5
   """).fetchall()

[('Massage Room 2', 'GUEST GUEST', 320),
 ('Massage Room 1', 'GUEST GUEST', 160),
 ('Massage Room 1', 'GUEST GUEST', 160),
 ('Massage Room 1', 'GUEST GUEST', 160),
 ('Tennis Court 2', 'GUEST GUEST', 150)]

In [ ]:
/* Q9: This time, produce the same result as in Q8, but using a subquery. */

In [228]:
cursor.execute("""
    SELECT Facility, Member, Cost
    FROM (
        SELECT f.name AS Facility, 
               m.firstname || ' ' || m.surname AS Member,
               CASE WHEN b.memid != 0 THEN f.membercost * b.slots
                    ELSE f.guestcost * b.slots
               END AS Cost
        FROM (
            SELECT memid, facid, slots
            FROM Bookings
            WHERE starttime > '2012-09-14' AND starttime < '2012-09-15'
        ) AS b
        JOIN Members AS m ON b.memid = m.memid
        JOIN Facilities AS f ON b.facid = f.facid
    )
    WHERE Cost > 30
    ORDER BY Cost DESC
    LIMIT 5
""").fetchall()

[('Massage Room 2', 'GUEST GUEST', 320),
 ('Massage Room 1', 'GUEST GUEST', 160),
 ('Massage Room 1', 'GUEST GUEST', 160),
 ('Massage Room 1', 'GUEST GUEST', 160),
 ('Tennis Court 2', 'GUEST GUEST', 150)]

In [ ]:
/* SQLITE

In [79]:
import sqlite3
conn = sqlite3.connect('sqlite_db_pythonsqlite.db')

In [80]:
c = conn.cursor()

In [81]:
for row in c.execute("SELECT * FROM Members"):
    print(row)

(0, 'GUEST', 'GUEST', 'GUEST', 0, '(000) 000-0000', '', '2012-07-01 00:00:00')
(1, 'Smith', 'Darren', '8 Bloomsbury Close, Boston', 4321, '555-555-5555', '', '2012-07-02 12:02:05')
(2, 'Smith', 'Tracy', '8 Bloomsbury Close, New York', 4321, '555-555-5555', '', '2012-07-02 12:08:23')
(3, 'Rownam', 'Tim', '23 Highway Way, Boston', 23423, '(844) 693-0723', '', '2012-07-03 09:32:15')
(4, 'Joplette', 'Janice', '20 Crossing Road, New York', 234, '(833) 942-4710', '1', '2012-07-03 10:25:05')
(5, 'Butters', 'Gerald', '1065 Huntingdon Avenue, Boston', 56754, '(844) 078-4130', '1', '2012-07-09 10:44:09')
(6, 'Tracy', 'Burton', '3 Tunisia Drive, Boston', 45678, '(822) 354-9973', '', '2012-07-15 08:52:55')
(7, 'Dare', 'Nancy', '6 Hunting Lodge Way, Boston', 10383, '(833) 776-4001', '4', '2012-07-25 08:59:12')
(8, 'Boothe', 'Tim', '3 Bloomsbury Close, Reading, 00234', 234, '(811) 433-2547', '3', '2012-07-25 16:02:35')
(9, 'Stibbons', 'Ponder', '5 Dragons Way, Winchester', 87630, '(833) 160-3900', '6', '2012-07-25 17:09:05')
(10, 'Owen', 'Charles', '52 Cheshire Grove, Winchester, 28563', 28563, '(855) 542-5251', '1', '2012-08-03 19:42:37')
(11, 'Jones', 'David', '976 Gnats Close, Reading', 33862, '(844) 536-8036', '4', '2012-08-06 16:32:55')
(12, 'Baker', 'Anne', '55 Powdery Street, Boston', 80743, '844-076-5141', '9', '2012-08-10 14:23:22')
(13, 'Farrell', 'Jemima', '103 Firth Avenue, North Reading', 57392, '(855) 016-0163', '', '2012-08-10 14:28:01')
(14, 'Smith', 'Jack', '252 Binkington Way, Boston', 69302, '(822) 163-3254', '1', '2012-08-10 16:22:05')
(15, 'Bader', 'Florence', '264 Ursula Drive, Westford', 84923, '(833) 499-3527', '9', '2012-08-10 17:52:03')
(16, 'Baker', 'Timothy', '329 James Street, Reading', 58393, '833-941-0824', '13', '2012-08-15 10:34:25')
(17, 'Pinker', 'David', '5 Impreza Road, Boston', 65332, '811 409-6734', '13', '2012-08-16 11:32:47')
(20, 'Genting', 'Matthew', '4 Nunnington Place, Wingfield, Boston', 52365, '(811) 972-1377', '5', '2012-08-19 14:55:55')
(21, 'Mackenzie', 'Anna', '64 Perkington Lane, Reading', 64577, '(822) 661-2898', '1', '2012-08-26 09:32:05')
(22, 'Coplin', 'Joan', '85 Bard Street, Bloomington, Boston', 43533, '(822) 499-2232', '16', '2012-08-29 08:32:41')
(24, 'Sarwin', 'Ramnaresh', '12 Bullington Lane, Boston', 65464, '(822) 413-1470', '15', '2012-09-01 08:44:42')
(26, 'Jones', 'Douglas', '976 Gnats Close, Reading', 11986, '844 536-8036', '11', '2012-09-02 18:43:05')
(27, 'Rumney', 'Henrietta', '3 Burkington Plaza, Boston', 78533, '(822) 989-8876', '20', '2012-09-05 08:42:35')
(28, 'Farrell', 'David', '437 Granite Farm Road, Westford', 43532, '(855) 755-9876', '', '2012-09-15 08:22:05')
(29, 'Worthington-Smyth', 'Henry', '55 Jagbi Way, North Reading', 97676, '(855) 894-3758', '2', '2012-09-17 12:27:15')
(30, 'Purview', 'Millicent', '641 Drudgery Close, Burnington, Boston', 34232, '(855) 941-9786', '2', '2012-09-18 19:04:01')
(33, 'Tupperware', 'Hyacinth', '33 Cheerful Plaza, Drake Road, Westford', 68666, '(822) 665-5327', '', '2012-09-18 19:32:05')
(35, 'Hunt', 'John', '5 Bullington Lane, Boston', 54333, '(899) 720-6978', '30', '2012-09-19 11:32:45')
(36, 'Crumpet', 'Erica', 'Crimson Road, North Reading', 75655, '(811) 732-4816', '2', '2012-09-22 08:36:38')
(37, 'Smith', 'Darren', '3 Funktown, Denzington, Boston', 66796, '(822) 577-3541', '', '2012-09-26 18:08:45')

In [84]:
 /* Q10: Produce a list of facilities with a total revenue less than 1000.
The output of facility name and total revenue, sorted by revenue. Remember
that there's a different cost for guests and members! */

In [88]:
# As sql query
q10_query = """SELECT sub.name, SUM( sub.revenue ) AS revenue
FROM (
SELECT b.facid, b.memid, f.name, f.guestcost, f.membercost, COUNT( b.facid ) AS facid_count,
CASE
WHEN b.memid =0
THEN COUNT( b.facid ) * f.guestcost
ELSE COUNT( b.facid ) * f.membercost
END AS 'revenue'
FROM Bookings AS b
LEFT JOIN Facilities AS f ON b.facid = f.facid
GROUP BY b.facid, b.memid
) AS sub
GROUP BY sub.facid
HAVING revenue <=1000"""

In [89]:
[row for row in c.execute(q10_query)]

[('Badminton Court', 604.5),
 ('Table Tennis', 90),
 ('Snooker Table', 115),
 ('Pool Table', 265)]

In [ ]:
/* Q11: Produce a report of members and who recommended them in alphabetic surname,firstname order */

In [90]:
q11_query = """SELECT m.surname, m.firstname, m.recommendedby AS recomender_id, r.surname, r.firstname
FROM Members AS m
LEFT JOIN Members AS r ON m.recommendedby = r.memid
WHERE m.recommendedby !=0
ORDER BY r.surname, r.firstname
"""

In [91]:
# The query does not create output none in sql but sqlite creates None value
for row in c.execute(q11_query):
    if row[3] != None:
        print(row)

('Sarwin', 'Ramnaresh', '15', 'Bader', 'Florence')
('Coplin', 'Joan', '16', 'Baker', 'Timothy')
('Genting', 'Matthew', '5', 'Butters', 'Gerald')
('Baker', 'Timothy', '13', 'Farrell', 'Jemima')
('Pinker', 'David', '13', 'Farrell', 'Jemima')
('Rumney', 'Henrietta', '20', 'Genting', 'Matthew')
('Jones', 'Douglas', '11', 'Jones', 'David')
('Dare', 'Nancy', '4', 'Joplette', 'Janice')
('Jones', 'David', '4', 'Joplette', 'Janice')
('Hunt', 'John', '30', 'Purview', 'Millicent')
('Boothe', 'Tim', '3', 'Rownam', 'Tim')
('Joplette', 'Janice', '1', 'Smith', 'Darren')
('Butters', 'Gerald', '1', 'Smith', 'Darren')
('Owen', 'Charles', '1', 'Smith', 'Darren')
('Smith', 'Jack', '1', 'Smith', 'Darren')
('Mackenzie', 'Anna', '1', 'Smith', 'Darren')
('Worthington-Smyth', 'Henry', '2', 'Smith', 'Tracy')
('Purview', 'Millicent', '2', 'Smith', 'Tracy')
('Crumpet', 'Erica', '2', 'Smith', 'Tracy')
('Baker', 'Anne', '9', 'Stibbons', 'Ponder')
('Bader', 'Florence', '9', 'Stibbons', 'Ponder')
('Stibbons', 'Ponder', '6', 'Tracy', 'Burton')

In [ ]:
/* Q12: Find the facilities with their usage by member, but not guests */

In [92]:
q12_query = """SELECT b.facid, COUNT( b.memid ) AS mem_usage, f.name
FROM (
SELECT facid, memid
FROM Bookings
WHERE memid !=0
) AS b
LEFT JOIN Facilities AS f ON b.facid = f.facid
GROUP BY b.facid"""

In [93]:
[row for row in c.execute(q12_query)]

[(0, 308, 'Tennis Court 1'),
 (1, 276, 'Tennis Court 2'),
 (2, 344, 'Badminton Court'),
 (3, 385, 'Table Tennis'),
 (4, 421, 'Massage Room 1'),
 (5, 27, 'Massage Room 2'),
 (6, 195, 'Squash Court'),
 (7, 421, 'Snooker Table'),
 (8, 783, 'Pool Table')]

In [ ]:
/* Q13: Find the facilities usage by month, but not guests */

In [96]:
# MONTH function does not work in sqlite
q13_query ="""SELECT b.months, COUNT( b.memid ) AS mem_usage
FROM (
SELECT strftime('%m', starttime ) AS months, memid
FROM Bookings
WHERE memid !=0
) AS b
GROUP BY b.months"""

In [97]:
[row for row in c.execute(q13_query)]

[('07', 480), ('08', 1168), ('09', 1512)]